# define sources
tap "homebrew/bundle"
tap "withgraphite/tap"
tap "aws/tap"

#####################################
# NOTE: you can check packages to be updated with:
# $ brew outdated

#####################################
# main packages
brew "act" # github actions locally running for development/debugging
brew "awscli"
brew "bash"
brew "black" # python formatter
brew "coreutils"
brew "deno" # js runtime for installing windmill
brew "eks-node-viewer"
brew "eksctl"
brew "fish" # my favorite shell
brew "git"
brew "git-lfs"
#brew "go"
brew "goaccess"
brew "gh" # github cli
brew "graphite" # git stacks
brew "helm"
brew "hub"
brew "just" # a command runner to explore
brew "jq"
brew "k9s" # kubernetes interface in terminal
brew "kind"
brew "kubecm"
brew "kubectx"
brew "kubernetes-cli"
brew "make" # mac base make is obsolete
brew "node@20"
brew "oq" # jq for json and yaml
brew "openssl@3"
brew "pre-commit"
brew "python@3.11" # TODO: deprecate
brew "python@3.12"
brew "starship"
brew "telnet"
brew "tree"
brew "terraform"
brew "terraform-docs"
brew "tmux"

# cask (not main)
cask "1password-cli"
cask "alfred"
cask "amazon-chime"
cask "cloudflare-warp"
cask "docker"
cask "iterm2"
cask "lens" # k8s best UI
cask "sonos"
cask "sublime-merge"
cask "visual-studio-code"
cask "zoom"

#####################################
# others that may be interesting:

# brew "colima" # docker macos alternative?
# brew "llm"
# brew "minikube" (use kind instead)
# brew "tmuxinator"
# brew "ultralist"
# brew "docker-compose" # NOT needed if you use docker desktop
# cask "warp" # AI terminal
