#####################################
# Install with:
# $ brew bundle
# NOTE: you can check packages to be updated with:
# $ brew outdated

#####################################
# define sources
tap "withgraphite/tap"
tap "aws/tap"

#####################################
# main packages
brew "act" # github actions locally running for development/debugging
brew "awscli"
brew "bash"
brew "black" # python formatter, to be deprecated with ruff and uv
brew "coreutils"
#brew "docker" # docker cli
#brew "docker-credential-helper"
brew "eksctl"
brew "fish" # my favorite shell
brew "git"
brew "git-lfs"
brew "go" # but using docker for different versions
brew "goaccess"
brew "gh" # github cli
brew "gnupg" 
brew "gpg2"
brew "graphite" # git stacks
brew "helm"
brew "hub"
brew "jq"
brew "k9s" # kubernetes interface in terminal
brew "kind"
brew "kubecm"
brew "kubectx"
brew "kubernetes-cli"
brew "logcli" # loki for grafana
brew "make" # mac base make is obsolete
brew "node@22"
brew "oq" # jq for json and yaml
brew "openssl@3"
brew "pinentry-mac" # for gpg sign
brew "pixi"
#brew "pre-commit"  # use a different python for this sigh
brew "python@3.11"  # legacy support
brew "python@3.12"
brew "python@3.13"
brew "skopeo"  # move containers images across registries
brew "starship"  # fish goodies
brew "telnet"
brew "tfenv"
brew "tree"
brew "terraform-docs"
brew "tmux"
brew "zoxide"
brew "fzf" # fuzzy session switcher
brew "tmuxinator"
brew "uv" # python packages, better than poetry
brew "yarn"
brew "yq"
brew "ykman"

#####################################
# cask: extra packages
cask "1password-cli"
cask "alfred"
#cask "amazon-chime"
cask "cloudflare-warp"
cask "claude-code"  # updates via UI instead?
cask "cursor"  # updates via UI instead?
cask "docker-desktop"
cask "dropbox"
#cask "kiro-cli"
cask "iterm2"
cask "lens" # k8s best interface
cask "ngrok"
cask "raycast"
cask "slack"
#cask "sonos"
cask "sublime-merge"
cask "visual-studio-code"
cask "zoom"

#####################################
# fresh setup

# git fix for sublime:
# $ git config core.commentChar ';'
# (then restart sublime)

# setup tfenv (install, list, use) 
# setup pre-commit (install)

# yubikey gpg sign
# gpg --card-edit
# admin
# passwd # set pin(s)
# key-attr
# generate
# (from another laptop export/import gpg priv key)

#####################################
# may be interesting

# brew "colima" # docker macos alternative?
# brew "deno" # js runtime for installing windmill
# brew "just" # a command runner to explore
# brew "minikube" (use kind instead)
# brew "llm"
# brew "ruff" # faster black
# brew "terraform"  # use tfenv instead
# brew "ultralist"
# brew "wireshark"

# cask "snowflake-snowsql"
# cask "warp" # AI terminal

#####################################
# not working anymore?
#brew "eks-node-viewer"
