# define sources
tap "homebrew/bundle"
tap "withgraphite/tap"
tap "aws/tap"

#####################################
# NOTE: you can check packages to be updated with:
# $ brew outdated

#####################################
# main packages
brew "act" # github actions locally running for development/debugging
brew "awscli"
brew "bash"
brew "black" # python formatter, to be deprecated
brew "coreutils"
brew "eks-node-viewer"
brew "eksctl"
brew "fish" # my favorite shell
brew "git"
brew "git-lfs"
brew "goaccess"
brew "gh" # github cli
brew "gnupg" 
brew "gpg2"
brew "graphite" # git stacks
brew "helm"
brew "hub"
brew "jq"
brew "k9s" # kubernetes interface in terminal
brew "kind"
brew "kubecm"
brew "kubectx"
brew "kubernetes-cli"
brew "logcli" # loki for grafana
brew "make" # mac base make is obsolete
brew "node@20"
brew "oq" # jq for json and yaml
brew "openssl@3"
brew "pinentry-mac"
brew "pixi"
brew "pre-commit"
brew "python@3.11"  # support ODM
brew "python@3.12"
brew "python@3.13"
brew "starship"  # fish goodies
brew "telnet"
brew "tfenv"
brew "tree"
brew "terraform-docs"
brew "tmux"
brew "tmuxinator"
brew "uv" # python packages, better than poetry
brew "yq"

# cask: extra packages
cask "1password-cli"
cask "alfred"
cask "cloudflare-warp"
cask "docker"
cask "iterm2"
cask "lens" # k8s best interface
cask "sonos"
cask "sublime-merge"
cask "visual-studio-code"
cask "zoom"

#####################################
# others that may be interesting:

# brew "colima" # docker macos alternative?
# brew "deno" # js runtime for installing windmill
# brew "go" # using docker for different versions
# brew "just" # a command runner to explore
# brew "minikube" (use kind instead)
# brew "llm"
# brew "ruff" # faster black
# brew "terraform"  # use tfenv instead
# brew "ultralist"
# brew "wireshark"

# cask "amazon-chime"
# cask "cursor"  # updates via UI instead
# cask "snowflake-snowsql"
# cask "warp" # AI terminal

