tap "aws/tap"
tap "cloudflare/cloudflare"
tap "datadog-labs/pack"
tap "ekristen/tap"
tap "entireio/tap"
tap "f1bonacc1/tap"
tap "oven-sh/bun"
tap "withgraphite/tap"
tap "yogeshsr/tap"
brew "act"
brew "openssl@3"
brew "awscli"
brew "bash"
brew "bats-core"
brew "black"
brew "coreutils"
brew "cask"
brew "cloudflared"
brew "datadog-static-analyzer"
brew "docker"
brew "docker-credential-helper"
brew "duti"
brew "eksctl"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "git-lfs"
brew "gnupg"
brew "go"
brew "goaccess"
brew "helm"
brew "hub"
brew "jq"
brew "just"
brew "k9s"
brew "kind"
brew "kubecm"
brew "kubectx"
brew "kubernetes-cli"
brew "logcli"
brew "make"
brew "node@20"
brew "node@22"
brew "oq"
brew "pinentry-mac"
brew "pixi"
brew "poppler"
brew "pre-commit", link: false
brew "python@3.11"
brew "python@3.12"
brew "python@3.13"
brew "rtk"
brew "shellcheck"
brew "skopeo"
brew "starship"
brew "telnet"
brew "terraform-docs"
brew "tfenv"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "uv"
brew "vale"
brew "watch"
brew "whosthere"
brew "xclip"
brew "yarn"
brew "ykman"
brew "yq"
brew "zoxide"
brew "aws/tap/eks-node-viewer"
brew "datadog-labs/pack/datadog-code-security-mcp"
brew "ekristen/tap/aws-nuke"
brew "f1bonacc1/tap/process-compose"
brew "oven-sh/bun/bun"
brew "withgraphite/tap/graphite"
brew "yogeshsr/tap/kafka-protobuf-console-consumer"
cask "1password-cli"
cask "alfred"
cask "amazon-chime"
cask "claude-code"
cask "cloudflare-warp"
cask "cursor"
cask "docker-desktop"
cask "dropbox"
cask "entireio/tap/entire"
cask "gcloud-cli"
cask "iterm2"
cask "kiro-cli"
cask "lens"
cask "ngrok"
cask "raycast"
cask "slack"
cask "sonos"
cask "sublime-merge"
cask "vibe-notch"
cask "visual-studio-code"
cask "zoom"
vscode "alefragnani.project-manager"
vscode "arturock.gitstash"
vscode "bmalehorn.vscode-fish"
vscode "codezombiech.gitignore"
vscode "davidanson.vscode-markdownlint"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "fabiospampinato.vscode-diff"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "ipedrazas.kubernetes-snippets"
vscode "jaakko.black"
vscode "janjoerke.jenkins-pipeline-linter-connector"
vscode "luisalvesmartins.markdown-code-to-png"
vscode "magicstack.magicpython"
vscode "mohsen1.prettify-json"
vscode "mrmlnc.vscode-json5"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.makefile-tools"
vscode "msyrus.go-doc"
vscode "pbkit.vscode-pbkit"
vscode "phind.phind"
vscode "redhat.vscode-yaml"
vscode "riccardonovaglia.missinglineendoffile"
vscode "ryu1kn.partial-diff"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sourcegraph.cody-ai"
vscode "supermaven.supermaven"
vscode "tabnine.tabnine-vscode"
vscode "tamasfe.even-better-toml"
vscode "tim-koehler.helm-intellisense"
vscode "tushortz.python-extended-snippets"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "windmill-labs.windmill"
vscode "yzhang.markdown-all-in-one"
vscode "ziyasal.vscode-open-in-github"
go "github.com/pdonorio/claude-context-proxy"
go "github.com/reugn/gemini-cli/cmd/gemini"
go "github.com/eliben/gemini-cli"
go "github.com/Pradumnasaraf/gencli"
go "github.com/pdonorio/mcp-fleet/cmd/mcpf"
uv "claude-todoist"
uv "graph-roadmap"
uv "memsearch[onnx]"
uv "paperagents"
uv "pre-commit"
uv "textaccounts"
uv "textmap"
uv "textprompts"
uv "textread"
uv "textsessions", with: ["textaccountsfile:///Users/projects/personal/paperworlds/textaccounts"]
uv "textworkspace"
uv "textworld", with: ["mcp>=1.0.0", "textgame-iofile:///Users/projects/personal/paperworlds/textgame-io"]
