tap "aws/tap"
tap "withgraphite/tap"
brew "act"
brew "openssl@3"
brew "awscli"
brew "bash"
brew "black"
brew "coreutils"
brew "duti"
brew "eksctl"
brew "fish"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "git-lfs"
brew "glow"
brew "gnupg"
brew "go"
brew "goaccess"
brew "graphite2"
brew "helm"
brew "hub"
brew "jq"
brew "just"
brew "k9s"
brew "kind"
brew "kubecm"
brew "kubectx"
brew "kubernetes-cli"
brew "logcli"
brew "make"
brew "node@22"
brew "oq"
brew "pinentry-mac"
brew "pixi"
brew "python@3.11"
brew "python@3.12"
brew "python@3.13"
brew "rtk"
brew "skopeo"
brew "starship"
brew "telnet"
brew "terraform-docs"
brew "tfenv"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "uv"
brew "yarn"
brew "ykman"
brew "yq"
brew "zoxide"
brew "withgraphite/tap/graphite"
cask "1password-cli"
cask "alfred"
cask "blip"
cask "claude"
cask "cloudflare-warp"
cask "cursor"
cask "docker-desktop"
cask "dropbox"
cask "gcloud-cli"
cask "iterm2"
cask "lens"
cask "ngrok"
cask "nordvpn"
cask "raycast"
cask "setapp"
cask "signal"
cask "slack"
cask "sublime-merge"
cask "visual-studio-code"
cask "wispr-flow"
cask "zoom"
uv "memsearch[onnx]"
uv "paradigm-cli"
uv "textaccounts"
uv "textbridge"
uv "textforums"
uv "textmap"
uv "textprompts"
uv "textread", with: ["textaccounts"]
uv "textsessions", with: ["textaccountsfile:///Users/projects/personal/paperworlds/textaccounts"]
uv "textworkspace"
